---
kind: type
id: T:Autodesk.Revit.DB.CombinableElementArray
source: html/dc5f6afb-a30d-dc82-fcd3-340eff1685c7.htm
---
# Autodesk.Revit.DB.CombinableElementArray

An array that contains CombinableElement objects.

## Syntax (C#)
```csharp
public class CombinableElementArray : APIObject,
	IEnumerable
```